       01  CUSTOMER-RECORD.
           05  CUSTOMER-ID        PIC 9(6).
           05  CUSTOMER-NAME      PIC X(20).
           05  STATE              PIC X(2).
           05  BALANCE            PIC S9(7)V99 COMP-3.
